{"title":"2013年工作总结","content":"1　回首往事\n\n       2013年就要过去了，对于我来说这可能是到目前为止经历过的最波折、最重要，也是最精彩的一年。这一年充满了迷茫与抉择，但它也给我留下了希望和回忆。从选择放弃以前的工作到返回大连，从学校毕业到待业，从海投简历到加入XX。回首过去，我希望能从中学到一些东西，发现一些问题和遗忘了的目标，然后为明天努力。\n\n       一年前的今天，当我坐在办公室的电脑前准备2012年的年终总结时，我在想，这究竟是不是一份我所热爱的工作。在那里，我感觉缺少了一些可以为之奋斗并点燃自己热情的东西，我感觉不到动力。我总在想那缺少的东西究竟是什么，那可能是自由，可能是激励，可能是希望，也可能是那里太过拥挤。那时候，我需要的也许就是一个理由，有了这个理由，我就会选择离开。\n \n       在那之后，我一边实习，一边开始学习JavaScript、MongoDB和C#，我为我的毕业设计选择了这些技术。我希望能做好我的毕设，让人生最美好的四年有个好点的结局。同时，我也真的为这些技术感到着迷。我觉得技术也是可以代表思想的，走不同的技术路线其实也是在践行自己的理想。虽然那时候我的工作是基于C++的开发，但是与C++的死气沉沉相比，我感觉到的是它们的活力，我觉得用它们可以实现自己的想法，而不是被令人厌烦的礼法所约束。所以，在那个时候，我希望有机会能找一份与之相关的工作。\n \n       再后来，到了7月，我毕业了。我的女朋友跟我一样，也不希望再回到北京。于是，我终于得到了那个理由，我离开了以前的公司，回到大连，然后从毕业陷入失业。我开始在网上选工作，但是没有任何回音。那可能是因为我不会日语，也可能是因为我毕业的学校不够响亮。总之，那段时间我体会到了因为找不到工作而天天在家过周末的绝望。但这也真的算是对我的当头棒喝，让我回到了现实，就像新闻里分析就业难的原因一样，是我自己的要求和期望太高了，我应该做的是沉下心，老实点。我开始海投简历，然后开始天天祈求上天能给我一个机会，我跟自己说，我没有白白浪费那四年，可为什么会穷途末路到连工作都没有的程度呢。直到一个月以后，XX给我打来了笔试电话。我非常努力的准备笔试，虽然我所准备的东西全都没考。一周后，我加入了公司，开始了全新的旅程。感谢上天，在这儿我不光得到了工作，还有我曾经期待的一切。\n\n\n        2　加入公司及主要工作\n\n        其实归根到底，我希望得到的是一种氛围，既可以做我应该做的事情，又有一些机会去做我喜欢做的事情。同时，又不那么死气沉沉。\n\n        加入公司之后是近两个月的培训，老实说，公司很负责，讲师们一直在努力地让我们能够学会他们所讲的课程，他们布置作业并提供反馈。我们公司绝不像其他我所知道的公司那样应付形式，然后草草了事。在培训的这段时间里，我对C#的语法有了一些更加深入的了解，对其他相关的开发技术也进行了一些学习。真心感谢这段时间TT对我的帮助，作为我的师傅，他让我少走了很多弯路，也让我对公司有了更多的了解。同时，我也很感谢WW所给予的那些鼓励，这很重要，这是动力的源泉。\n\n        培训结束后，我开始参加公司的一个新项目“MM”的开发工作，刚参与工作就遇上一个全新的项目，这对于我来说真是极好的运气。在参与开发项目的过程中，我学到了很多东西。以前我从来没有做过ASP.NET的开发，所以通过这个项目，我了解了ASP.NET开发的过程、概念和语法。后来，我又协助项目进行国际化词条的处理，虽然这真心是一件非常枯燥的工作，但是我觉得，选择“发现后改变”是很重要的。我深深感觉到国际化这种工作十分重复、无聊，而且作为一名开发人员，将全部的精力投入到这种冗余且本可以被自动化的工作上是很难让自己所接受的，加之以前刚好学习过WinForm的简单开发，所以出于简化工作的想法，做了一个简单的国际化小工具。虽然效果甚微，但是它至少帮助我在国际化的过程中避免了濒临崩溃的感觉。\n\n        在项目的开发过程中，我还协助YY姐对项目的前端CSS样式和JS代码进行了一些整理，并有机会编写了项目的几个小模块。YY姐绝对是我见过所有前端开发中最专业的！同时，也有机会协助BB哥对项目后台的数据库代码进行一些简单的开发工作。感谢YY姐和BB哥对于我这个新人的耐心和教诲，你们让我对公司的开发流程有了最基本且最必要的认识。\n\n        除去参加公司培训的时间，我真正参与实际工作的时间已近3个月，可是由于水平有限，加之适应能力不强，缺乏足够的经验，所以当我回头看时，发现自己真的没有什么工作值得叙述，自己也没能为公司和团队做出更多的贡献。\n\n        作为新人，在这段时间里，最应感谢的当属HH哥了。感谢HH哥为我们提供机会去学习和成长，而不是仅仅被束缚在工作上。这一切让我们大家都有可能、有空间去提高自身，感谢您为我们所作出的考虑。\n\n        3　工作中的一些感想\n\n        从我来到公司至今，已经过去近5个月。从大家的身上我感受到了热情、认真和团结，这些是我在其他地方所不曾感受到的。同时，我也发现了许多自己的不足。作为一名开发人员，应该保持与大家更多的沟通。这一点我做的不是很好，缺乏沟通将会导致对于需求理解的偏差，从而导致自己做许多无用功，浪费开发时间，也会令自己与团队疏远。另一点就是自己的想法总是过于主观，总是被自己的感觉所控制，这样导致有的时候开发的效率被自己的心情所影响，这些问题都是非常值得我去注意和改正的。\n\n        编写程序，这既是我的职业又是我的爱好。但是，作为公司的雇员，它更多的应该是我的职业，这是我应该首先做好的事情，所以不应在工作上掺杂过多自己的事情，不能因为自己的感觉而影响工作。同时，作为团队的一员，应该对自己负责，不能说没有依据的话，这是我需要改变的，不能仅仅通过自己的感觉就去下定结论，我需要冷静和镇定。总是被情绪所控制，可能好多时候的很多问题没有找到真正的原因。\n\n        回想以前实习的时候，有一些重要的经验，自己也在一点点的遗忘。比如，不要总是给自己的错误寻找借口，这一点是我在实习期间最大的感悟，可现在又渐渐地忘却，就像辉哥说过的，人总是对自己宽容，这是值得警惕的。\n\n        另外，在工作的过程也有许多值得自己注意的地方。比如，平时应该多做总结，将自己曾经经历过的相似的知识点联系在一起进行记录，把所学的内容变成网状，而非树状。不要惧怕任何类型的工作，要发现令人讨厌工作中的机遇，将其转化为动力，并将自己的想法转换为行动。对于自己的疑问，一定要去弄清楚，因为这是对自己负责，同时，一定要记住，学习是为了自己，而不是为了别人。\n\n        可能有的时候我的想法有些过于主观。但是，我还是希望能将一些看法说出来。我觉得我们大家在工作中都非常认真，团队的氛围也非常非常好，同事间的友善，相对自由的工作环境和空间，这都是非常值得珍惜的。但是，我感觉我们大家可能也缺少了一点儿职业化的因素，我们有的时候没有将工作当做是真正的职业，这一点可能是我们的不足。职业化是我们把工作转化为动力的因素，我们是时候永远抛开学生这个身份了。只有将自己的工作视为职业，才能更多的投入精力并承担责任，然后努力将自己的职业转化为自己的事业。不过，这只是自己的一点感觉，如果说的不对，请一定见谅。\n\n         4　2014展望与规划\n\n        在新的一年里，针对技术方面，我会继续学习 .NET平台下的基础技术，并针对ASP.NET的结构和思想进行一些深入的了解，希望对ASP.NET的相关技术能够扎实的掌握。同时，利用空余的时间进一步对之前的国际化小工具进行完善，实现词条批量上传等功能，使其真正成为可以为大家所用的实用工具。另外，会继续深入学习JavaScript的更多内容，并了解和熟悉公司已有的前端控件类库（PPP）。\n\n         针对产品方面，会利用业余时间学习Microsoft Dynamics CRM的相关概念和开发技术，了解Windows Azure的相关技术并掌握DD产品的详细使用，学习和初步了解MM代码。如有时间，则对Hadoop技术做相关的了解。\n\n        在新的一年里，我希望通过自己的努力，学会更多的东西，并利用所学技术为大家做出更多有益的贡献。无悔于自己，也无愧于他人。\n\n        以上就是我对2013年的总结，谢谢！"}